# DimensionShape Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..DimensionShape Property
Dimension Class See Also
---
The shape of this dimension.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DimensionShape DimensionShape { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DimensionShape As DimensionShape
	Get
```

Visual C++
---
```text
public:
property DimensionShape DimensionShape {
	DimensionShape get ();
}
```

# See Also
Dimension Class
Autodesk.Revit.DB Namespace